Revit 2026 API

# AnalyticalMemberSetMemberForces(MemberForces) Method

---

Sets Member Forces to Analytical Member.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMemberForces(
	MemberForces memberForces
)
```
```vb
Public Sub SetMemberForces (
	memberForces As MemberForces
)
```
```cpp
public:
void SetMemberForces(
	MemberForces^ memberForces
)
```
```fsharp
member SetMemberForces :
        memberForces : MemberForces -> unit
```

#### Parameters

memberForces MemberForces
     End to which member forces will be added is defined by setting [!:Autodesk::Revit::DB::Structure::MemberForces::Position] property in provided Member Forces object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If element already have member forces defined for that end, newly provided values replace current one. Member forces are strictly related with releases. This means that setting member forces values is reasonable only for directions that have releases set to false.

#### Reference

AnalyticalMember Class

SetMemberForces Overload

Autodesk.Revit.DB.Structure Namespace